import Footer from "@/components/footer/Footer";
import styles from "./article-page.module.css";
import Header from "@/components/header/Header";
import MainHero from "@/components/main-hero/MainHero";
import imageWebFraud from "../../../public/images/web_fraud.webp";
import structuredData from "@/structured-data/apatesArticle.json";
import type { Metadata } from "next";
import type { ImageObject } from "@/types";

export const metadata: Metadata = {
	title: "NovaConstant — NickChachlioutis | Οδηγός προστασίας από διαδικτυακές απάτες",
	openGraph: {
		title: "NovaConstant — NickChachlioutis | Οδηγός προστασίας από διαδικτυακές απάτες",
		description:
			"Ανάπτυξη ιστοσελίδων για τον 21ο αιώνα. Υψηλού επιπέδου διαδικτυακές υπηρεσίες προσαρμοσμένες στις ανάγκες και το brand σας.",
		url: "https://www.nickchachlioutis.gr/blog/odigos-prostasias-apo-diadiktyakes-apates",
		siteName: "NovaConstant — NickChachlioutis",
		images: [
			{
				url: "/images/nickchachlioutis.png",
				width: 1200,
				height: 630,
			},
		],
		locale: "el_GR",
		type: "website",
	},
	alternates: {
		canonical: "https://www.nickchachlioutis.gr/blog/odigos-prostasias-apo-diadiktyakes-apates",
	},
};

const image: ImageObject = {
	src: imageWebFraud,
	alt: "Το Next.js κερδίζει το Wordpress σε αγώνα πυγμαχίας.",
	width: "901",
	height: "661",
};

export default function ApatesArticle() {
	return (
		<div className={styles.container}>
			<script type="application/ld+json" dangerouslySetInnerHTML={{ __html: JSON.stringify(structuredData) }} />
			<Header />
			<main>
				<MainHero
					tag="Διαδικτυακές απάτες"
					title={
						<>
							Οδηγός προστασίας από διαδικτυακές <em>απάτες</em>
						</>
					}
					subtitle="Καθώς το διαδίκτυο μετατρέπεται στην κύρια πλατφόρμα αγορών, χρειάζεται να γνωρίζουμε βασικές μεθόδους προστασίας."
					image={image}
				/>
				<article className={styles.articlePage}>
					<p>
						Προσφάτως ένα στενό οικογενειακό μου πρόσωπο έπεσε θύμα διαδικτυακής απάτης. Για ευνόητους λόγους δεν μπορώ να μπω
						σε λεπτομέρειες, οπότε θα φέρω ένα παραπλήσιο παράδειγμα και πως μπορούμε να προστατευτούμε.
					</p>
					<h2>Πολύ καλό για να είναι αληθινό</h2>
					<p>
						Ας υποθέσουμε ότι ανακαλύπτετε ένα e-shop στο οποίο βρίσκεται σε πολύ χαμηλή τιμή το τελευταίο μοντέλο iPhone. Στο
						site αναφέρεται ότι πρόκειται για καινούριο, όχι μεταχειρισμένο με κάποια προβλήματα, στη τιμή, ας πούμε, των 200€.
						Όσοι γνωρίζουν τις τιμές στις οποίες κυμαίνονται τα iPhone, αμέσως θα καταλάβει ότι πρόκειται για μια εξωπραγματικά
						χαμηλή τιμή. Τόσο χαμηλή που προξενεί καχυποψία.
					</p>
					<p>
						Το πρώτο πράγμα που πρέπει να προσέχουμε είναι πως αν κάτι φαίνεται πολύ καλό για να είναι αληθινό, μάλλον δεν είναι
						αληθινό.
					</p>
					<h2>Μέθοδοι πληρωμής</h2>
					<p>
						Ας υποθέσουμε όμως ότι δεν γνωρίζετε που κυμαίνονται γενικά οι τιμές του συγκεκριμένου προϊόντος, ή ότι η τιμή δεν
						είναι τόσο εκτός του συνηθισμένου εύρους ώστε να παραπέμπει αυτόματα σε απάτη. Οότε, αποφασίζετε να το ρισκάρετε και
						προβείτε σε αγορά. Βάζετε το προϊόν στο ψηφιακό καλάθι σας και συνεχίζετε για την πληρωμή.
					</p>
					<p>
						Φτάνοντας στη σελίδα της πληρωμής, βλέπετε ότι η μοναδική μέθοδος πληρωμής είναι η τραπεζική μεταφορά, Ή, μπορεί να
						υπάρχουν κι άλλες επιλογές, αλλά το e-shop προσπαθεί να προωθήσει τη τραπεζική μεταφορά ως μέθοδο πληρωμής κάνοντας
						κάποια έκπτωση σε όσους την επιλέγουν.
					</p>
					<p>
						Ποτέ δεν πρέπει να προβαίνουμε σε διαδικτυακές αγορές με τραπεζική μεταφορά! Σε περίπτωση που κάτι πάει στραβά και
						το προϊόν που παραλάβουμε είναι διαφορετικό απ&apos; αυτό που αγοράσαμε, ή δεν μας παραδοθεί καν κάποιο προϊόν, η
						τραπεζική μεταφορά είναι σχεδόν αδύνατον ν&apos; αντιστραφεί και να πάρουμε τα χρήματά μας πίσω!
					</p>
					<p>
						Οι ασφαλείς μέθοδοι για ηλεκτρονικές πληρωμές είναι το PayPal κι οι διάφορες κάρτες – χρεωστικές, πιστωτικές,
						προπληρωμένες, από Visa, Mastercard, κλπ. Το ίδιο ισχύει και με το Google Pay και Apple Pay, καθώς στην ουσία
						πρόκειται για πληρωμή με κάποια κάρτα που καταχωρήσαμε στο αντίστοιχο ψηφιακό πορτοφόλι. Κάνοντας αγορά με PayPal ή
						κάποια κάρτα, αν κάτι πάει στραβά, μπορούμε ν&apos; απευθυνθούμε στην αντίστοιχη εταιρεία που χρησιμοποιήσαμε και να
						κάνουμε αμφισβήτηση της συναλλαγής. Πρόκειται για μια διαδικασία που ίσως χρειαστεί αρκετές εβδομάδες, όμως είναι
						σχεδόν βέβαιο ότι η συναλλαγή θ&apos; ακυρωθεί και θα μας επιστρεφούν τα χρήματα.
					</p>
					<p>
						Και φυσικά, ποτέ δεν βάζουμε απ&apos; ευθείας τα στοχεία της κάρτας μας σε μια ύποπτη ιστοσελίδα αλλά μόνο σε
						ασφαλές τρίτο περιβάλλον.
					</p>
					<h2>Ψηφιακή αρχειοθέτηση της απάτης</h2>
					<p>
						Αν υποψιάζεστε ότι βρίσκεστε ενώπιον μιας διαδικτυακής απάτης αλλά μολαταύτα θέλετε να το ρισκάρετε και προβείτε σε
						αγορά, θα ήταν πολύ καλό βήμα πριν κάνετε την αγορά να αρχειοθετήσετε την ιστοσελίδα με το συγκεκριμένο προϊόν που
						αγοράζετε. Σε πολλές περιπτώσεις διαδικτυακής απάτης, αφού ο απατεώνας μαζέψει τα χρήματα των πληρωμών κλείνει το
						e-shop κι εξαφανίζεται. Αν εσείς αρχειοθετήσατε τη συγκεκριμένη ιστοσελίδα με το προϊόν που αγοράσατε πριν το
						ψεύτικο e-shop εξαφανιστεί και συνεπώς έχετε ένα αποδεικτικό στοιχείο της απάτης, έχετε ένα πολύ καλό χαρτί στα
						χέρια σας το οποίο θα επιταχύνει τη διαδικασία επιστροφής των χρημάτων στην κάρτα σας.
					</p>
					<p>
						Ο τρόπος για την αρχειοθέτηση μιας οποιασδήποτε ιστοσελίδας είναι πολύ απλός. Μπορούμε να χρησιμοποιήσουμε το
						Wayback Machine του Internet Archive. Το Internet Archive είναι μια αμερικανική μη-κερδοσκοπική ψηφιακή βιβλιοθήκη.
						Μεταξύ άλλων, αρχειοθετεί κι ιστότοπους με τη βιβλιοθήκη Wayback Machine, στην οποία μπορεί ο καθένας εντελώς δωρεάν
						να προσθέσει μια ιστοσελίδα προς αρχειοθέτηση. Η αρχειοθέτηση γίνεται αυτόματα μόλις κάποιος καταχωρίσει τον
						σύνδεσμο μιας ιστοσελίδας. To Wayback Machine καταχωρεί την ιστοσελίδα που το δώσατε ακριβώς όπως ήταν τη στιγμή που
						κάνετε την καταχώρηση. Ακόμη κι αν στο μέλλον ο ιδιοκτήτης της ιστοσελίδας κατεβάσει την ιστοσελίδα του ή
						τροποποιήσει το περιεχόμενό της, η καταχώρηση στο Wayback Machine δεν επηρεάζεται και παραμένει ως είχε.
					</p>
					<p>
						Αν θέλετε να καταχωρίσετε μια ιστοσελίδα στο Wayback Machine μπορείτε να κάνετε κλικ{" "}
						<a href="https://web.archive.org/save" target="_blank">
							εδώ
						</a>
						. Στη σελίδα που θ&apos; ανοίξε εισάγετε στο πεδίο τον σύνδεσμο της ιστοσελίδας που θέλετε ν&apos; αρχειοθετήσετε,
						πατήστε Save, και μετά φυλάξτε τον σύνδεσμο που θα σας δωθεί με την αρχειοθέτηση που μόλις κάνατε. Έτσι, ακόμη κι αν
						τελικά πέσετε θύμα απάτης κι απατεώνας εξαφανίσει μετά το ψεύτικο e-shop, εσείς θα έχετε στα χέρια σας ένα
						αποδεικτικό στοιχείο της απάτης που μπορείτε να χρησιμοποιήσετε τόσο για την επιστροφή των χρημάτων σας ή ακόμη και
						νομικά. Αρχειοθετήσεις από τη Wayback Machine του Internet Archive αναγνωρίζονται διεθνώς, της Ελλάδας
						συμπεριλαμβανομένης, ως αποδεικτικά στοιχεία σε δίκες για διαδικτυακές απάτες.
					</p>
				</article>
			</main>
			<Footer />
		</div>
	);
}
